test007/raw_logs/s2_med_concurrency-b1_short_prompt_low_qps.log
Pre-resolved vllm-target-test007-s2-med-concurrency -> [10.110.87.209]
Loading tokenizer: Qwen2.5-0.5B-Instruct
No tokenizer.json for 'Qwen2.5-0.5B-Instruct', trying tiktoken format...
Tiktoken also not available (Tokenizer error: No tiktoken model file found for 'Qwen2.5-0.5B-Instruct'), trying server-side tokenization...
Tokenizer: Server (vocab_size≈131072)
Tokenizer loaded successfully.
Generating 2 random prompts...
Generated 2 prompts in 0.02s
Sampling 2 prompts for verification...
Sample verification passed, skipping full verification.
Starting main benchmark run...
Traffic request rate: 1
Burstiness factor: 1 (Poisson process)
Maximum request concurrency: 2
================= Serving Benchmark Result =================
Successful requests:                     2         
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  3.26      
Total input tokens:                      1024      
Total generated tokens:                  256       
Request throughput (req/s):              0.61      
Output token throughput (tok/s):         78.58     
Peak output token throughput (tok/s):    165.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          392.88    
--------------------Time to First Token---------------------
Mean TTFT (ms):                          247.89    
Median TTFT (ms):                        247.89    
P99 TTFT (ms):                           452.84    
P90 TTFT (ms):                           415.19    
----------Time per Output Token (excl. 1st token)-----------
Mean TPOT (ms):                          9.60      
Median TPOT (ms):                        9.60      
P99 TPOT (ms):                           9.62      
P90 TPOT (ms):                           9.62      
--------------------Inter-token Latency---------------------
Mean ITL (ms):                           9.60      
Median ITL (ms):                         9.30      
P99 ITL (ms):                            12.96     
P90 ITL (ms):                            10.52     
---------------------End-to-end Latency---------------------
Mean E2EL (ms):                          1467.58   
Median E2EL (ms):                        1467.58   
P99 E2EL (ms):                           1674.49   
P90 E2EL (ms):                           1636.48   
============================================================
Results saved to /results/test007/raw_json/s2_med_concurrency-b1_short_prompt_low_qps.json

Open-file limit: 1048576